esbenp.prettier-vscode
magicstack.MagicPython
mhutchie.git-graph
ms-pyright.pyright
ms-python.python
PKief.material-icon-theme
SonarSource.sonarlint-vscode
sourcery.sourcery
TabNine.tabnine-vscode
zhuangtongfa.material-theme
adpyke.codesnap
alexcvzz.vscode-sqlite
DavidAnson.vscode-markdownlint
esbenp.prettier-vscode
magicstack.MagicPython
mechatroner.rainbow-csv
mhutchie.git-graph
ms-pyright.pyright
ms-python.python
PKief.material-icon-theme
RandomFractalsInc.vscode-data-preview
SonarSource.sonarlint-vscode
sourcery.sourcery
TabNine.tabnine-vscode
zhuangtongfa.material-theme